app/controllers/events_controller.rb

  def save
    event = Event.new(
      employee_id: event_params[:employee_id],
      kind: event_params[:kind],
      unix_timestamp: event_params[:timestamp]
    )

    if event.save
---
INSERT INTO "events" ("employee_id", "timestamp", "kind", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["employee_id", 1], ["timestamp", "1970-01-01 00:00:00"], ["kind", "in"], ["created_at", "2024-08-13 06:32:21.618034"], ["updated_at", "2024-08-13 06:32:21.618034"]]